//Задача №10
Console.WriteLine("Введите трёхзначное число");
int A = Convert.ToInt32(Console.ReadLine());
string numberTwo = Convert.ToString(A);
Console.WriteLine("вторая цифра "+numberTwo[1]);